Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K09.tmx
Source language: en_us
Languages: zh_cn

source: Ice Man
zh_cn: 冰人

source: THE DAY VICTOR turned twenty he rode three bulls, big ones, a good 1,800 pounds each - Cyclone, Spanish Fly, and Bulldozer - rode all their bucks and twists, Victor's free hand waving the air until the buzzer honked at eight seconds for each ride, not one of the bulls able to throw him.
zh_cn: 维克托（Victor）在他二十岁那一天骑了三头公牛，三头大家伙，每头都足足有1800磅重——龙卷风（Cyclone）、西班牙苍蝇（Spanish Fly）和推土机（Bulldozer）——驾驭它们所有的弓背跳跃和转身扭摆，维克托空出来的手在空中挥舞直到铃声在每一赛程八秒钟时响起，没有一头牛能把他摔下来。

source: He rolled off their rumps, stumbled, keeping his feet, and walked to the gate not bothering to look at the bulls, see if they still wanted to kill him.
zh_cn: 他从牛臀上翻身下来，脚步踉跄，稳了稳脚跟，他走向大门，对那几头牛都懒得去看一眼，看它们是否还想杀了他。

source: He won Top Bull Rider, 4,000 dollars and a new saddle at the All-Indian National Rodeo in Palm Springs.
zh_cn: 他在棕榈泉（Palm Springs）的全印第安国家牛仔大赛（All-Indian National Rodeo）上赢得了公牛骑士冠军、4000美元和一副新鞍具。

source: It came to...
zh_cn: 这相当于......

source: Jesus, like 200 dollars a second.
zh_cn: 天啊，差不多是一秒钟200美元。

source: That afternoon Victorio Colorado, the name he went by in the program, was the man.
zh_cn: 那天下午维克托利奥·科罗拉多（Victorio Colorado）——他参赛所用的名字——就是那个最牛的人。

source: HE LEFT THE RODEO GROUNDS as Victor to celebrate with two Mojave boys, Nachee and Billy Cosa, brought along from Arizona when the boss, Kyle McCoy, moved his business to Indio, near Palm Springs.
zh_cn: 他以维克托的身份离开牛仔赛场，和两个来自莫哈韦沙漠（Mojave）的小伙——那奇（Nachee）和比利·考萨（Billy Cosa），他们是老板凯尔·麦考伊（Kyle McCoy）把生意迁到棕榈泉附近的印第欧市（Indio）时从亚利桑那州带过来的——去庆祝。

source: The Mojave boys handled Kyle's fighting bulls, bringing them from the pens to the chute where Victor, a Mimbre?o Apache, would slip aboard from the fence, wrap his hand in the bull rope tight as he could get it, and believe he was ready to ride.
zh_cn: 莫哈韦小伙负责凯尔的斗牛，把它们从围栏赶到倾斜的水槽处，在那里维克托，一个明布雷诺·阿帕契人（Mimbre?o Apache，印第安人的一个种族），会悄悄地从栅栏上爬上牛背，把牛绳尽可能紧地缠在手上，认为自己准备好骑牛了。

source: He'd take a breath, say "Let me out of here," and the gate would swing open and a ton of pissed-off bull would come flying out.
zh_cn: 他会深吸一口气，说“让我出去吧，”，然后大门打开，一吨重的公牛气急败坏地飞奔而出。

source: "His mind made up," he told the Mojave boys at Mi Nidito in Palm Springs, "to kill anybody's on his back.
zh_cn: “它打定了主意，”在棕榈泉的米·尼蒂头（Mi Nidito，墨西哥餐馆）他对莫哈韦小伙说，“要杀死它背上的任何人。

source: See, he behaves in the chute.
zh_cn: 你们看见了，它在水槽那儿表现得很乖。

source: What he's doing, he's saving his dirty tricks till he has room to buck you off and stomp you, kick out your teeth."
zh_cn: 它在干什么，它在保留它那卑鄙的诡计直到它有机会把你摔下去、踩踏你、踢掉你的大牙。”

source: They were at a table on the bar side of the place, Mi Nidito, a good one, some Agua Caliente Indians here after the rodeo.
zh_cn: 他们坐在这个地方吧台那一边的一张桌子旁，米·尼蒂头，一个好地方，一些阿瓜卡连特（Agua Caliente）的印第安人在牛仔竞技赛后到这里来。

source: Victor was telling stories his Mojave buddies had heard, but they were happy, Victor was buying the tequila shooters and beers.
zh_cn: 维克托在讲他的莫哈韦朋友们已经听过的故事，但他们很开心，维克托买了龙舌兰酒和啤酒。

source: Now he was telling them what he'd learned about bulls working for Kyle McCoy since he was a kid: how to ride the bucks tight, feel what the bull was about to do next.
zh_cn: 现在他在告诉他们他自孩提时就为凯尔·麦考伊工作而学到的东西：如何在牛弓背跃起时紧紧地驾驭它，感觉它下一步要做什么。

source: "I ask Kyle, 'What's that mean? Feel what he's gonna do?' I'm asking him how to ride a bull twenty times bigger than me.
zh_cn: “我问凯尔，‘那是什么意思？感觉它要做什么？’我问他如何骑一头比我大二十倍的公牛。

source: Kyle goes, 'You become one with the bull or land on your ass.'
zh_cn: 凯尔说，‘你要么与公牛成为一体要么屁股摔在地上。’

source: I had to figure out for myself what he meant.
zh_cn: 我必须自个儿弄清楚他的意思。

source: Two years in a row Kyle McCoy's world's best bull rider, twenty-four, twenty-five years old.
zh_cn: 凯尔·麦考伊连续两年是世界最佳公牛骑手，二十四岁，二十五岁。

source: Five years later he's world champion again and said, 'That's it,' quit before he ever landed on his head.
zh_cn: 五年后他又一次成为世界冠军，说：‘就这样了，’在他没有把脑袋摔到地上以前退出了。

source: Kyle wore his range hat, never put on that helmet they offer you now.
zh_cn: 凯尔戴他的牧牛帽，从不戴他们现在提供的那种头盔。

source: Quit in pretty good shape and moved to Indio to raise his bulls."
zh_cn: 在非常好的状态下离开，搬到印第欧市来养他的公牛。”

source: "All killers," Nachee said.
zh_cn: “全面杀手，”那奇说。

source: "But he started with heifers," Victor said. "You approach a mean heifer out on the graze? She gives you a dirty look and chases you the hell off."
zh_cn: “但他却从养小母牛开始，”维克托说，“你接近过一头在外面吃草的讨厌的小母牛吗？它恶狠狠地看你一眼，然后追得你屁滚尿流。”

source: Victor saw Nachee and Billy Cosa looking toward the entrance and turned his head to see a Riverside County deputy talking to the manager.
zh_cn: 维克托看到那奇和比利·考萨向门口张望，他转过头看到一个里弗赛德县（Riverside County）的警官正在对经理说话。

source: Some more law was outside.
zh_cn: 还有几名警察在外面。

source: They'd go around to the kitchen and check on Mexicans without any papers.
zh_cn: 他们要到厨房去看看，检查没有任何证件的墨西哥人。

source: Victor saw the Riverside deputy look his way.
zh_cn: 维克托看到那个里弗赛德的警官向他这边看。

source: No, he was looking at the white guy at the next table, the guy wearing a straw Stetson he'd fool with, raising the curled brim and setting it close on his eyes again. Never changed his expression.
zh_cn: 不，他在看旁边那桌的白人，那人戴一顶让他想取笑的斯泰森（Stetson）草帽，他抬起卷曲的帽沿，又放到眼睛边上，表情一直未变。

source: He had size, but looked ten years past herding cows.
zh_cn: 他虽然有那个个头，但看上去已经过了放牛的年纪有十年了。

source: It was the man's U.S. Government jacket told Victor he was none of their business.
zh_cn: 是那个人的美国政府夹克告诉维克托他和他们不是一路的。

source: Victor said to his buddies:
zh_cn: 维克托对他的朋友说：

source: "What Kyle did, he'd look for heifers were always pissed off and started with two of the meanest girls he could find.
zh_cn: “凯尔做了什么，他要找总是发火的小母牛，从两头他能找到的最难对付的开始。

source: He named one Stormy, after a stripper he'd see he went to New Orleans, and the other one Julie, after the movie star was his girlfriend on and off, everybody thinking they'd get married till she walked out on him.
zh_cn: 其中一头他取名为思桃米（Stormy），是以他在新奥尔良（New Orleans）见过的一个脱衣舞娘来命名的，另一头叫朱莉（Julie），以曾经是他女友的电影明星命名，每个人都认为他们会结婚的直到她抛下他走了。

source: Kyle was spending more time getting his heifers laid than whatever he was doing with Julie Reyes."
zh_cn: 雷耶斯（Julie Reyes）一起做的所有事，凯尔花了更多的时间让他的小母牛产仔。”

source: "He was crazy," Billy Cosa said. "Julie Reyes is the coolest chick I ever saw in my life.
zh_cn: “他疯了，”比利·考萨说，“朱莉·雷耶斯是我一生中见过的最好的女孩。

source: She look at you with her dark eyes has lights in them... ?
zh_cn: 她那亮闪闪的黑眼睛看着你......

source: Man, I forget what I'm saying to her."
zh_cn: ？啊，我忘了跟她说了什么。”

source: Victor said he heard Julie was in Hollywood making vampire movies.
zh_cn: 维克托说他听说朱莉在好莱坞拍吸血鬼电影。

source: "And Kyle's in the bull-humping business.
zh_cn: “而凯尔在做公牛配种的生意。

source: Kyle's making more money than he ever did rodeoin and I guess Julie's a movie actress."
zh_cn: 凯尔赚了比他以前在牛仔竞赛时更多的钱，我猜朱莉是个电影女演员。”

source: "Vampire flicks," Nachee said. "I see her last one, I come out of the show after, Kyle McCoy's there lighting up.
zh_cn: “吸血鬼电影，”那奇说，“我看了她最近的一部，电影结束后我出来，凯尔·麦考伊在那里正在点香烟。

source: I smoke one with him, ask him how he like the flick.
zh_cn: 我和他吸了一支，问他电影怎么样。

source: He say he don't care for her being a vampire.
zh_cn: 他说他不在乎她是个吸血鬼。

source: A week later he sole Julie, asking a hundred grand and got close to it."
zh_cn: 一个星期后他卖了朱莉，要价十万美元，差不多也卖了这个价。”

source: "He sole the girl name Julie," Billy Cosa said, "or the heifer?"
zh_cn: “他卖了那个叫朱莉的女孩，”比利·考萨说，“还是叫朱莉的母牛？”

source: Nachee raised one hand to give Billy a lazy high-five.
zh_cn: 那奇举起一只手，懒散地和比利击了一下掌。

source: The white dude in the cowboy hat, still watching them, was laughing out loud.
zh_cn: 那个戴着牛仔帽的白人家伙，还在看着他们，大声笑了出来。

source: Victor looked over to see him grinning now, the guy telling them, "I'd say the boy's in trouble, he don't know a woman from a cow.
zh_cn: 维克托看过去，看到他此刻正在咧着嘴笑，那个家伙对他们说：“要我说那小子麻烦了，他分不清女人和母牛。

source: Else he's had too much firewater."
zh_cn: 要不就是他喝了太多烈酒。”

source: By this time Victor believed he and the Mojave boys had each put down four shots of tequila, toasting his rides, and a few Dos Equis for chasers.
zh_cn: 到了此时维克托料定他和莫哈韦小伙们每个人都已经干下了四杯龙舌兰，为他的赛牛干杯，还有少许双X啤酒（Dos Equis，墨西哥品牌啤酒）作为烈酒后饮品。

source: No matter, he was celebrating with his NDN brothers and would tell this nitwit Billy was kidding.
zh_cn: 没关系，他在和他的印第安兄弟庆祝，打算告诉这个傻子比利在开玩笑。

source: But then he was thinking, Why you want to explain it to him?
zh_cn: 但随后他想，为什么要向他解释？

source: Cause he wears a U.S. Government jacket? Now the white guy was getting up from the table, and Victor looked at his buddies and shook his head once, side to side, and said, "Don't fuck with him," though he believed he probably would.
zh_cn: 因为他穿着一件美国政府的夹克？这时那个白人家伙从桌旁站起来，维克托看向他的朋友，摇了一下头，从一边到另一边，说：“别和他掺乎，”尽管他认为他可能会。

source: This guy in the cowboy hat was standing now, watching a girl coming from the bar with a drink in her hand.
zh_cn: 这个戴牛仔帽的家伙现在站着，看着一个从吧台过来手里端着一杯酒的女孩。

source: She walked up to the nitwit, saying, "The bartender finally got the Stoli Doli right."
zh_cn: 她走向那个傻瓜，说：“那个酒保终于将斯桃丽·多丽（Stoli Doli）调正确了。”

source: She stood with the white dude listening to him talking to her, nodding his cowboy hat at the three boys.
zh_cn: 她和这个白人家伙站在一起，听他说话，他的牛仔帽向那三个男孩点了一下。

source: The girl's shirt was open two buttons, and her hair was mussed.
zh_cn: 那个女孩的衬衫开了两个钮扣，她的头发乱糟糟的。

source: The U.S. Government white dude leaned close to tell her - maybe, Victor thought - what he was going to do next.
zh_cn: 那个美国政府的白人家伙向她靠过去告诉她——可能，维克托想——他下一步打算做什么。

source: The girl seemed to listen but without much interest.
zh_cn: 那个女孩似乎在听，但没多少兴趣。

source: Now she was taking a pack of cigarettes from her shirt pocket, got one out but didn't light it, waiting for the white guy.
zh_cn: 现在她从她衬衫口袋里拿出一盒香烟，取出一支，但没点上，在等那个白人家伙。

source: He stood there a moment adjusting his hat, setting it close on his eyes, the curved brim pointing at Victor.
zh_cn: 他在那儿站了一会儿整理他的帽子，戴在靠近眼睛边上，弯曲的帽沿指向维克托。

source: Now he used both hands to pop the snaps on his U.S. Government jacket.
zh_cn: 现在他用双手啪啪地拉开他的美国政府夹克上的摁扣。

source: He held it open so they could read the words reversed in white on the dark T-shirt.
zh_cn: 他敞开夹克让他们能够看到黑色T恤衫上的白色字。

source: It said in capital letters:
zh_cn: 上面用大写字母印着：

source: ICE MAN
zh_cn: 冰人（ICE MAN）

source: He said, "Fellas, you happen to know what I-C-E stands for?"
zh_cn: 他说：“伙计们，你们碰巧知道I-C-E代表什么吧？”

source: Victor could tell him it meant Immigration and Customs Enforcement, you turkey, but said, "Does it mean you deliver ice to places like this one for drinks, maybe shrimp cocktails? I understand it's what icemen do, but I don't think I know any."
zh_cn: 维克托可以告诉他那是移民和海关执法局（Immigration and Customs Enforcement）的意思，你个鬼佬，但他说：“那意思是不是你给象这里的地方送冰做饮料，或许是鲜虾鸡尾酒？我认为那是冰人做的活儿，但我想我不认识任何一个这样的人。”

source: "What I deliver," the Ice Man said, "I take illegal aliens to prison.
zh_cn: “我送的是，”冰人说，“我把非法的外国人送进监狱。

source: People speaking foreign tongues and think obeying the law's a bunch of shit, refuse to follow the goddamn law of the land.
zh_cn: 讲外国话的人认为服从法律的是一帮混蛋，拒绝遵守当地天杀的法律。

source: I heard you saying you work for Kyle McCoy, but I don't recall seeing you since Kyle moved out here.
zh_cn: 我听到你说你为凯尔·麦考伊工作，但我想不起来自从凯尔搬到这里后见过你。

source: I suppose cause you people, same as the colored, all look pretty much the same.
zh_cn: 我猜想是因为你们这些人，和有色人种一样，看起来差不多都一样。

source: You know what white people in olden times use to call Indins? Goddamn red niggers."
zh_cn: 你知道白人在以前的时候叫印第安人什么吗？天杀的红鬼。”

source: Victor said, "You know what Apaches still call white people? Los Goddammies, because many of you cannot talk without swearing.
zh_cn: 维克托说：“你知道阿帕契人仍在叫白人什么吗？一堆天杀的，因为你们中的很多人不骂人就不会说话。

source: You use God's name even when you don't have a reason to.
zh_cn: 即使在没有任何原因的时候也用上天的名号诅咒。

source: Maybe you agree with me, maybe you don't.
zh_cn: 你可能同意我说的，也可能不同意。

source: But you said people who speak in foreign tongues refuse to follow the goddamn laws of the land.
zh_cn: 但你说讲外国话的人拒绝遵守当地天杀的法律。

source: You saying all of us should speak only English?"This Ice Man took time to stare at Victor.
zh_cn: 你说我们所有人应该只说英语？” 冰人从容地盯着维克托。

source: He said, "They teach you that at Indin school? I hope you aren't getting smart with me.
zh_cn: 他说：“他们在印第安学校里教你了吧？我希望你别跟我耍小聪明。

source: I see you drinkin...
zh_cn: 我看到你在喝......

source: Can you show me you're old enough by law?"
zh_cn: 你能证明你到法定年龄了吗？”

source: Victor said, "This is what it's about, my age?"
zh_cn: 维克托说：“这有关系吗？我的年龄？”

source: "You show me you're old enough," the Ice Man said, "I'll let you step outside and arrest you for being shit-faced drunk."
zh_cn: “你给我证明你到年龄了，”冰人说，“我就让你走出去，然后再因为喝得烂醉逮捕你。”

source: "You kidding me?"
zh_cn: “你开玩笑？”

source: "Drunk and disorderly, arguing with me."
zh_cn: “醉酒并妨害治安，与我争吵。”

source: Victor said, "You go to all this trouble - " Nachee said, "Because we NDN, we must be drunk."
zh_cn: 维克托说：“你费这么大劲——”那奇说：“因为我们是印第安人，我们必须喝醉。”

source: "The three of you actin up," the Ice Man said. "I been watchin you since you come in."
zh_cn: “你们三个行为不端，”冰人说，“自打你们一进来我就在观察你们。”

source: "Man," Nachee said, "Victor rode three bulls today.
zh_cn: “老兄，”那奇说，“维克托今天骑了三头公牛。

source: We drinking to his honor."
zh_cn: 我们为了他的荣誉喝酒。”

source: "What'd he win," the Ice Man said, "trading beads?"
zh_cn: “他赢了什么，”冰人说，“贸易珠（trading beads，兼有货币作用的珠子）？”

source: "Four thousand dollars, man, and a saddle."
zh_cn: “四千美元呀，还有一副鞍具。”

source: Victor took the roll of bills from his shirt pocket and laid the wad on the table.
zh_cn: 维克托从他衬衫口袋里拿出那卷钞票，放到桌上。

source: The Ice Man, looking at the money, raised his hat and set it on his head again saying, "The bulls buck any, or they too old? I can cite you now for tryin to bribe an officer of the law."
zh_cn: 冰人看着钱举起他的帽子，然后又放到他头上，说：“那些公牛跳起来了吗？还是它们太老了？我现在可以因你试图贿赂司法官员而传呼你。”

source: Victor said, "I'm not offering you anything."
zh_cn: 维克托说：“我没给你什么东西。”

source: "You're mouthin off, arguing with me.
zh_cn: “你顶嘴，和我吵。

source: Give me your names and we'll get her done."
zh_cn: 报上你的名字，我们就此了结。”

source: Victor said, "My Mimbre?o Apache name is Deer With Horns Running Through the Woods Being Chased by a White Dude Wearing a Cowboy Hat."
zh_cn: 维克托说：“我的明布雷诺·阿帕契名字是长着角的鹿跑过森林被一个戴着牛仔帽的白人家伙追赶。”

source: Nachee said, "You know Agua Calientes operate the casinos? They get to watch white men become drunk and lose all their money."
zh_cn: 那奇说：“你知道阿瓜卡连特人经营的娱乐场吗？他们开始监督喝醉酒和输光钱的白人。”

source: "Keep talking," the Ice Man said.
zh_cn: “继续说，”冰人说。

source: Nachee said, "You know how NDNs know it's safe to go fishing in the winter? When all the white guys quit falling through the fucking ice."
zh_cn: 那奇说：“你知道印第安人是怎么知道在冬天钓鱼是安全的吗？当所有白人不再掉进该死的冰里的时候。”

source: This time the Ice Man only stared, no expression on his face.
zh_cn: 这一次冰人只是盯着看，脸上没有任何表情。

source: "I was in a bar," Nachee said, "where a white man with a cigar was blowing smoke rings, nine or ten of them hanging in the air.
zh_cn: “我以前在一家酒吧里，”那奇说，“那里一个抽雪茄的白人在吐烟圈，九、十个悬在空中。

source: I look at the rings and said to him, 'One more remark like that, I'll bust you in the mouth.'"
zh_cn: 我看着那些烟圈，对他说：‘再说一句那样的话，我就砸烂你的嘴。’”

source: The Ice Man said, "I was at a Indin wedding on the rez one time.
zh_cn: 冰人说：“有一次我在居留区参加了一个印第安人婚礼。

source: The flower girls were all the bride's kids, her bastards.
zh_cn: 花童都是新娘的孩子，她的私生子。

source: You hear that one? Or, how do you tell a rich Indin from a poor one? The rich Indin has two cars up on blocks."
zh_cn: 你听说过这回事吧？或者，你们如何区分有钱的印第安人和没钱的印第安人？有钱的印第安人在木架上放两辆车。”

source: He waited a moment and said, "We're through here," picked up his cellphone and said, "Wesley, I might need a hand."
zh_cn: 他等了一会儿又说：“我们就到这里了。”拿起他的手机说：“韦斯利（Wesley），我可能需要帮手。”

source: WHAT WAS GOING ON? Nachee never carried ID working bulls.
zh_cn: 发生什么事了？那奇从不带着身份证照料公牛。

source: Victor didn't either.
zh_cn: 维克托也不。

source: They both believed if you know who you are, what do you need ID for? You want to tell somebody your name, tell him.
zh_cn: 他们两个认为如果你知道自己是谁，要身份证做什么？你想告诉某个人你的名字，就告诉他。

source: You don't want to, don't.
zh_cn: 你不想，就不告诉。

source: The only question Nachee thought of: Why did Kyle McCoy move his bull ranch from Arizona to Indio, California?
zh_cn: 那奇想的唯一一个问题是：为什么凯尔·麦考伊把他的养牛场从亚里桑那州搬到加利福尼亚印第欧市？

source: The only reason he could think of: now that Kyle's bulls were making him rich, he had time for Julie Reyes in Hollywood making movies.
zh_cn: 他能想到的唯一原因是：现在凯尔的牛使他致富了，他有时间去追在好莱坞拍电影的朱莉·雷耶斯了。

source: He hoped so.
zh_cn: 他希望如此。

source: Nachee was dying to see her again.
zh_cn: 那奇渴望再次见到她。

source: He saw deputies in their serious hats coming through the restaurant from the kitchen, four white guys who looked like they meant business, serious, minds made up, and Nachee thought of a grandfather now from the other time, more than a hundred years ago, Nachitay, sitting in Mi Nidito with Victor's grandfather from the same time, Victorio.
zh_cn: 他看到警察戴着他们严肃的帽子从厨房过来，穿过餐厅，四个白人，他们看上去一副公事公办、态度严肃、下定决心的样子，而那奇此时却想起来自另一个时代的祖辈，一百多年前，那奇太（Nachitay），与同一时代的维克托的祖辈维克托利奥（Victorio）坐在米·尼蒂头。
